app/controllers/api/items_controller.rb

SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    # debugger
    @item = Item.find_by(id: params[:id])