app/controllers/api/users_controller.rb

INSERT INTO "users" ("email", "session_token", "password_digest", "created_at", "updated_at", "first_name", "last_name", "company_name", "mailing_list") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    # debugger
     @user = User.new(user_params)
     if @user.save!